bekencorp/armino/middleware/soc/bk7236/soc/sys_reg.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define SYS_DEVICE_ID_ADDR (SOC_SYS_REG_BASE + (0x0 << 2))

#define SYS_DEVICE_ID_DEVICEID_POS (0)
#define SYS_DEVICE_ID_DEVICEID_MASK (0xffffffff)

#define SYS_VERSION_ID_ADDR (SOC_SYS_REG_BASE + (0x1 << 2))

#define SYS_VERSION_ID_VERSIONID_POS (0)
#define SYS_VERSION_ID_VERSIONID_MASK (0xffffffff)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_ADDR (SOC_SYS_REG_BASE + (0x2 << 2))

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_BOOT_MODE_POS (0)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_BOOT_MODE_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_1_7_POS (1)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_1_7_MASK (0x7f)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_JTAG_CORE_SEL_POS (8)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_JTAG_CORE_SEL_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FLASH_SEL_POS (9)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FLASH_SEL_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_10_31_POS (10)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_10_31_MASK (0x3fffff)

#define SYS_CPU_CURRENT_RUN_STATUS_ADDR (SOC_SYS_REG_BASE + (0x3 << 2))

#define SYS_CPU_CURRENT_RUN_STATUS_CORE0_HALTED_POS (0)
#define SYS_CPU_CURRENT_RUN_STATUS_CORE0_HALTED_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CORE1_HALTED_POS (1)
#define SYS_CPU_CURRENT_RUN_STATUS_CORE1_HALTED_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_2_3_POS (2)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_2_3_MASK (0x3)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_SW_RESET_POS (4)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_SW_RESET_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_SW_RESET_POS (5)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_SW_RESET_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_6_7_POS (6)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_6_7_MASK (0x3)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_PWR_DW_STATE_POS (8)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_PWR_DW_STATE_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_PWR_DW_STATE_POS (9)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_PWR_DW_STATE_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_10_31_POS (10)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_10_31_MASK (0x3fffff)

#define SYS_CPU0_INT_HALT_CLK_OP_ADDR (SOC_SYS_REG_BASE + (0x4 << 2))

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SW_RST_POS (0)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SW_RST_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_PWR_DW_POS (1)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_PWR_DW_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_INT_MASK_POS (2)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_INT_MASK_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_HALT_POS (3)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_HALT_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_RESERVED_4_7_POS (4)
#define SYS_CPU0_INT_HALT_CLK_OP_RESERVED_4_7_MASK (0xf)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_OFFSET_POS (8)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_OFFSET_MASK (0xffffff)

#define SYS_CPU1_INT_HALT_CLK_OP_ADDR (SOC_SYS_REG_BASE + (0x5 << 2))

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_SW_RST_POS (0)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_SW_RST_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_PWR_DW_POS (1)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_PWR_DW_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_INT_MASK_POS (2)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_INT_MASK_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_HALT_POS (3)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_HALT_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU0_BUS_CLK_2DIV_POS (4)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU0_BUS_CLK_2DIV_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_5_7_POS (5)
#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_5_7_MASK (0x7)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_OFFSET_POS (8)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_OFFSET_MASK (0xffffff)

#define SYS_RESERVED_REG0X6_ADDR (SOC_SYS_REG_BASE + (0x6 << 2))

#define SYS_RESERVED_REG0X6_RESERVED_0_31_POS (0)
#define SYS_RESERVED_REG0X6_RESERVED_0_31_MASK (0xffffffff)

#define SYS_CPU_CLK_DIV_MODE1_ADDR (SOC_SYS_REG_BASE + (0x8 << 2))

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_CORE_POS (0)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_CORE_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_CORE_POS (4)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_CORE_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_BUS_POS (6)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_BUS_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_RESERVED_BIT_7_7_POS (7)
#define SYS_CPU_CLK_DIV_MODE1_RESERVED_BIT_7_7_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_UART0_POS (8)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_UART0_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CLKSEL_UART0_POS (10)
#define SYS_CPU_CLK_DIV_MODE1_CLKSEL_UART0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_UART1_POS (11)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_UART1_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_UART1_POS (13)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_UART1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_UART2_POS (14)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_UART2_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_UART2_POS (16)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_UART2_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_SADC_POS (17)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_SADC_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_PWM0_POS (18)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_PWM0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_PWM1_POS (19)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_PWM1_MASK (0x1)

